from typing import List


def get_california_s_cities(filename: str = './cities.csv') -> List[str]:
    """
    Петя отлынивал от работы последнюю недели и любовался котиками, вместо работы.
    Но завтра у Пети намечен важный аналитический отчёт.

    Помогите Пете извлечь нужные данные, реализовав данную функцию.
    В cities.csv лежит информация о городах америки.
    Необходимо получить список городов штата калифорния, начинающихся на букву 'S'
    в шатете калифорния ('CA').


    **Реализация должна обязательно использовать модуль csv**

    :param filename: название файла, в котором находится список городов
    :return: Список городов штата калифорния, начинающихся с буквы 'S'
    """
    return []
